Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/pmc.h
/* -------- PMC_SLPWK_DR1 : (PMC Offset: 0x138) ( /W 32) SleepWalking Disable Register 1 -------- */
#define PMC_SLPWK_DR1_PID32_Pos               _UINT32_(0)                                          /* (PMC_SLPWK_DR1) Peripheral 32 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID32_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID32_Pos)           /* (PMC_SLPWK_DR1) Peripheral 32 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID32(value)            (PMC_SLPWK_DR1_PID32_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID32_Pos)) /* Assignment of value for PID32 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID33_Pos               _UINT32_(1)                                          /* (PMC_SLPWK_DR1) Peripheral 33 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID33_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID33_Pos)           /* (PMC_SLPWK_DR1) Peripheral 33 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID33(value)            (PMC_SLPWK_DR1_PID33_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID33_Pos)) /* Assignment of value for PID33 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID34_Pos               _UINT32_(2)                                          /* (PMC_SLPWK_DR1) Peripheral 34 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID34_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID34_Pos)           /* (PMC_SLPWK_DR1) Peripheral 34 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID34(value)            (PMC_SLPWK_DR1_PID34_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID34_Pos)) /* Assignment of value for PID34 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID35_Pos               _UINT32_(3)                                          /* (PMC_SLPWK_DR1) Peripheral 35 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID35_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID35_Pos)           /* (PMC_SLPWK_DR1) Peripheral 35 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID35(value)            (PMC_SLPWK_DR1_PID35_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID35_Pos)) /* Assignment of value for PID35 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID37_Pos               _UINT32_(5)                                          /* (PMC_SLPWK_DR1) Peripheral 37 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID37_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID37_Pos)           /* (PMC_SLPWK_DR1) Peripheral 37 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID37(value)            (PMC_SLPWK_DR1_PID37_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID37_Pos)) /* Assignment of value for PID37 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID39_Pos               _UINT32_(7)                                          /* (PMC_SLPWK_DR1) Peripheral 39 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID39_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID39_Pos)           /* (PMC_SLPWK_DR1) Peripheral 39 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID39(value)            (PMC_SLPWK_DR1_PID39_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID39_Pos)) /* Assignment of value for PID39 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID40_Pos               _UINT32_(8)                                          /* (PMC_SLPWK_DR1) Peripheral 40 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID40_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID40_Pos)           /* (PMC_SLPWK_DR1) Peripheral 40 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID40(value)            (PMC_SLPWK_DR1_PID40_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID40_Pos)) /* Assignment of value for PID40 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID41_Pos               _UINT32_(9)                                          /* (PMC_SLPWK_DR1) Peripheral 41 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID41_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID41_Pos)           /* (PMC_SLPWK_DR1) Peripheral 41 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID41(value)            (PMC_SLPWK_DR1_PID41_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID41_Pos)) /* Assignment of value for PID41 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID42_Pos               _UINT32_(10)                                         /* (PMC_SLPWK_DR1) Peripheral 42 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID42_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID42_Pos)           /* (PMC_SLPWK_DR1) Peripheral 42 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID42(value)            (PMC_SLPWK_DR1_PID42_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID42_Pos)) /* Assignment of value for PID42 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID43_Pos               _UINT32_(11)                                         /* (PMC_SLPWK_DR1) Peripheral 43 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID43_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID43_Pos)           /* (PMC_SLPWK_DR1) Peripheral 43 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID43(value)            (PMC_SLPWK_DR1_PID43_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID43_Pos)) /* Assignment of value for PID43 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID44_Pos               _UINT32_(12)                                         /* (PMC_SLPWK_DR1) Peripheral 44 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID44_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID44_Pos)           /* (PMC_SLPWK_DR1) Peripheral 44 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID44(value)            (PMC_SLPWK_DR1_PID44_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID44_Pos)) /* Assignment of value for PID44 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID45_Pos               _UINT32_(13)                                         /* (PMC_SLPWK_DR1) Peripheral 45 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID45_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID45_Pos)           /* (PMC_SLPWK_DR1) Peripheral 45 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID45(value)            (PMC_SLPWK_DR1_PID45_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID45_Pos)) /* Assignment of value for PID45 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID46_Pos               _UINT32_(14)                                         /* (PMC_SLPWK_DR1) Peripheral 46 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID46_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID46_Pos)           /* (PMC_SLPWK_DR1) Peripheral 46 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID46(value)            (PMC_SLPWK_DR1_PID46_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID46_Pos)) /* Assignment of value for PID46 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID47_Pos               _UINT32_(15)                                         /* (PMC_SLPWK_DR1) Peripheral 47 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID47_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID47_Pos)           /* (PMC_SLPWK_DR1) Peripheral 47 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID47(value)            (PMC_SLPWK_DR1_PID47_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID47_Pos)) /* Assignment of value for PID47 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID48_Pos               _UINT32_(16)                                         /* (PMC_SLPWK_DR1) Peripheral 48 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID48_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID48_Pos)           /* (PMC_SLPWK_DR1) Peripheral 48 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID48(value)            (PMC_SLPWK_DR1_PID48_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID48_Pos)) /* Assignment of value for PID48 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID49_Pos               _UINT32_(17)                                         /* (PMC_SLPWK_DR1) Peripheral 49 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID49_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID49_Pos)           /* (PMC_SLPWK_DR1) Peripheral 49 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID49(value)            (PMC_SLPWK_DR1_PID49_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID49_Pos)) /* Assignment of value for PID49 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID50_Pos               _UINT32_(18)                                         /* (PMC_SLPWK_DR1) Peripheral 50 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID50_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID50_Pos)           /* (PMC_SLPWK_DR1) Peripheral 50 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID50(value)            (PMC_SLPWK_DR1_PID50_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID50_Pos)) /* Assignment of value for PID50 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID51_Pos               _UINT32_(19)                                         /* (PMC_SLPWK_DR1) Peripheral 51 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID51_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID51_Pos)           /* (PMC_SLPWK_DR1) Peripheral 51 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID51(value)            (PMC_SLPWK_DR1_PID51_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID51_Pos)) /* Assignment of value for PID51 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID52_Pos               _UINT32_(20)                                         /* (PMC_SLPWK_DR1) Peripheral 52 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID52_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID52_Pos)           /* (PMC_SLPWK_DR1) Peripheral 52 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID52(value)            (PMC_SLPWK_DR1_PID52_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID52_Pos)) /* Assignment of value for PID52 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID53_Pos               _UINT32_(21)                                         /* (PMC_SLPWK_DR1) Peripheral 53 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID53_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID53_Pos)           /* (PMC_SLPWK_DR1) Peripheral 53 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID53(value)            (PMC_SLPWK_DR1_PID53_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID53_Pos)) /* Assignment of value for PID53 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID56_Pos               _UINT32_(24)                                         /* (PMC_SLPWK_DR1) Peripheral 56 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID56_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID56_Pos)           /* (PMC_SLPWK_DR1) Peripheral 56 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID56(value)            (PMC_SLPWK_DR1_PID56_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID56_Pos)) /* Assignment of value for PID56 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID57_Pos               _UINT32_(25)                                         /* (PMC_SLPWK_DR1) Peripheral 57 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID57_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID57_Pos)           /* (PMC_SLPWK_DR1) Peripheral 57 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID57(value)            (PMC_SLPWK_DR1_PID57_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID57_Pos)) /* Assignment of value for PID57 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID58_Pos               _UINT32_(26)                                         /* (PMC_SLPWK_DR1) Peripheral 58 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID58_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID58_Pos)           /* (PMC_SLPWK_DR1) Peripheral 58 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID58(value)            (PMC_SLPWK_DR1_PID58_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID58_Pos)) /* Assignment of value for PID58 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID59_Pos               _UINT32_(27)                                         /* (PMC_SLPWK_DR1) Peripheral 59 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID59_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID59_Pos)           /* (PMC_SLPWK_DR1) Peripheral 59 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID59(value)            (PMC_SLPWK_DR1_PID59_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID59_Pos)) /* Assignment of value for PID59 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_PID60_Pos               _UINT32_(28)                                         /* (PMC_SLPWK_DR1) Peripheral 60 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID60_Msk               (_UINT32_(0x1) << PMC_SLPWK_DR1_PID60_Pos)           /* (PMC_SLPWK_DR1) Peripheral 60 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID60(value)            (PMC_SLPWK_DR1_PID60_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID60_Pos)) /* Assignment of value for PID60 in the PMC_SLPWK_DR1 register */
#define PMC_SLPWK_DR1_Msk                     _UINT32_(0x1F3FFFAF)                                 /* (PMC_SLPWK_DR1) Register Mask  */

#define PMC_SLPWK_DR1_PID_Pos                 _UINT32_(0)                                          /* (PMC_SLPWK_DR1 Position) Peripheral 6x SleepWalking Disable */
#define PMC_SLPWK_DR1_PID_Msk                 (_UINT32_(0x1FFFFFF) << PMC_SLPWK_DR1_PID_Pos)       /* (PMC_SLPWK_DR1 Mask) PID */
#define PMC_SLPWK_DR1_PID(value)              (PMC_SLPWK_DR1_PID_Msk & (_UINT32_(value) << PMC_SLPWK_DR1_PID_Pos)) 

